hiperiondev/esp32idf_APRS/main/aprs_service.c
    // afskModem on the Radio page: 0=300 Bd, 1=1200 Bd Bell202, 2=1200 Bd V.23,
    // 3=9600 Bd G3RUH. modem_mode_t uses exactly the same numbering
    // (MODEM_MODEM_AFSK300=0 .. MODEM_MODEM_G3RUH=3), which is why this is a
    // plain cast; page_radio.c already clamps the field to 0-3.
    cfg->modem = (modem_mode_t)g_config.afsk_modem_type;

    // audioLPF on the Radio page is the flat-audio-input flag despite its
    // name: it tells the demodulator that the receiver feeds it discriminator
    // (unfiltered) audio rather than speaker audio, which is exactly what
    // modem_config_t.flat_audio selects. Direct one-to-one mapping.
    cfg->flat_audio = g_config.audio_lpf;

    cfg->preamble_ms = g_config.preamble;
    cfg->slot_time_ms = g_config.tx_timeslot;
    cfg->persist = g_config.csma_persist;
    cfg->fx25_mode = g_config.fx25_mode;
    cfg->allow_non_aprs = false;

    // Extra minimum PTT-off (unkeyed) hold time between transmissions, on
    // top of the fixed one-service-tick release holdoff the modem component
    // always applies (see Ax25TransmitCheck()'s txReleaseHoldoff in ax25.c).
    // Web-configurable (Radiomodem page, Audio/AFSK section), 0 = disabled
    // (only the fixed one-tick floor applies).
    cfg->min_unkey_ms = g_config.ptt_min_unkey_ms;

    // PTT pin and PTT active level are both fixed at compile time
    // (MODEM_PTT_GPIO / MODEM_PTT_ACTIVE_HIGH, set from the top-level
    // CMakeLists.txt); neither is part of modem_config_t as a user-facing
    // setting, and neither is configurable from the Radiomodem web page.
    cfg->ptt_active_high = (MODEM_PTT_ACTIVE_HIGH != 0);

    // Half duplex for real on-air use: MODEM_DEFAULT_CONFIG() ships full
    // duplex (it targets the wire-loopback demo), which would key up over
    // anyone already transmitting. CSMA/quiet time comes from txTimeSlot,
    // and the p-persistent transmit probability comes from csma_persist.
    // The LOOP TEST passes true here because a DAC->ADC wire means the node
    // always hears its own carrier and would never see a clear channel.
    cfg->full_duplex = full_duplex;
}

// ---------------------------------------------------------------------------
// Dashboard statistics.
//
// These are the counters the web dashboard's STATISTICS panel actually wants
// (page_common.c's page_sidebar_info()): total RF frames decoded, total RF
// frames transmitted, frames relayed RF->INET and INET->RF, digipeated
// frames, and drop/error counts - all independent of whether the digipeater
// or IGate features are even enabled.
//
// These are tracked directly at the points where frames actually flow
// (on_rx_frame(), aprs_service_send_tnc2(), inet2rfHandler(), and inside
// aprs_msg_callback() for the digi/igate/error cases), rather than derived
// from igate_get_stats() - whose counters only increment from inside
// igateProcess(), and only when g_config.igate_en is true (see
// aprs_msg_callback() below). With the feature off (a very common RX-only/
// monitor setup), feature-derived counters would stay at 0 regardless of how
// much real RF traffic the modem decodes; tracking at the flow points makes
// the dashboard reflect reality whether or not either feature is turned on.
static atomic_uint_fast32_t s_statRadioRx = 0; // frames decoded off RF (every on_rx_frame() call)
static atomic_uint_fast32_t s_statRadioTx = 0; // frames transmitted on RF (every successful aprs_service_send_tnc2())
static atomic_uint_fast32_t s_statRf2Inet = 0; // frames relayed from RF to APRS-IS (igateProcess() actually uplinked one)
static atomic_uint_fast32_t s_statInet2Rf = 0; // lines relayed from APRS-IS to RF (inet2rfHandler() actually transmitted one)
static atomic_uint_fast32_t s_statDigi = 0;    // frames digipeated (path rewritten and re-transmitted)
// The two below track drops/errors independently of the feature-specific
// accounting in igate_get_stats() (see page_common.c's page_sidebar_info()),
// whose counters only move while igate_en is on. For a monitor/RX-only setup
// (both features off - very common while
// characterizing modem decode performance), feature-derived DROP/ERR would
// stay pinned at 0 even with plenty of real RF activity. These two are
// tracked at
// every point a frame is actually discarded - on the RX side in
// on_rx_frame()/aprs_msg_callback(), and on the TX side in
// aprs_service_send_tnc2() (RF TX queue full, oversized packet, modem not
// ready yet, or modem_send_tnc2() itself failing) - so they move regardless
// of which higher-level features are enabled and regardless of which
// direction the discard happens in.
static atomic_uint_fast32_t s_statDrop =
    0; // frames discarded before dispatch or on the way out to RF (placeholder/invalid source callsign, modem-not-ready, TX queue full, oversized packet, etc.)
static atomic_uint_fast32_t s_statErr =
    0; // frames that failed to decode as valid APRS (UI, no-layer-3) AX.25, or that the modem itself failed to transmit (modem_send_tnc2() error)

// Task permitted to briefly block on a full RF TX ring (see the drain-wait in
// aprs_service_send_tnc2()). Set to the beacon scheduler task via
// aprs_service_set_beacon_context(); NULL for everyone else, so the RX/digipeat,
// INET2RF and message paths keep their non-blocking drop-if-full behavior and a
// busy RF leg never stalls RX decode or the APRS-IS socket task.
static volatile TaskHandle_t s_beaconCtxTask = NULL;

// Forward declaration: the duty-cycle accumulator (state and the rest of its
// helpers) is defined further down, right before the TX helper that feeds it,
// but aprs_service_get_stats() below needs the live percentage too.
static uint8_t duty_cycle_pct(void);

void aprs_service_set_beacon_context(void) {
    s_beaconCtxTask = xTaskGetCurrentTaskHandle();
}

aprs_service_stats_t aprs_service_get_stats(void) {
    aprs_service_stats_t s;
    s.radio_rx = (uint32_t)atomic_load_explicit(&s_statRadioRx, memory_order_relaxed);
    s.radio_tx = (uint32_t)atomic_load_explicit(&s_statRadioTx, memory_order_relaxed);
    s.rf2inet = (uint32_t)atomic_load_explicit(&s_statRf2Inet, memory_order_relaxed);
    s.inet2rf = (uint32_t)atomic_load_explicit(&s_statInet2Rf, memory_order_relaxed);
    s.digi = (uint32_t)atomic_load_explicit(&s_statDigi, memory_order_relaxed);
    s.drop = (uint32_t)atomic_load_explicit(&s_statDrop, memory_order_relaxed);
    s.err = (uint32_t)atomic_load_explicit(&s_statErr, memory_order_relaxed);

    // Current RF TX ring backlog and the effective cap it is measured against,
    // surfaced so the dashboard can show beacons queueing up (and, with the
    // drop counter above, being lost) without a serial cable. Reported straight
    // from the modem ring and the same clamped g_config.rf_tx_buffers value
    // aprs_service_send_tnc2() enforces, so the two always agree.
    s.tx_queue_depth = (uint32_t)modem_tx_queue_depth();

    // CSMA anti-starvation events, read live from the modem rather than
    // mirrored into a local counter: both are free-running totals since boot,
    // so the snapshot is always current and there is no forwarding pass to
    // fall behind or double-count. Neither is a drop - the frame goes out in
    // both cases - which is why they are reported here and not through
    // igate_note_drop().
    s.csma_busy_forced = modem_channel_busy_count();
    s.csma_persist_forced = modem_persistence_missed_count();

