hiperiondev/esp32idf_APRS/main/aprs_service.c
    // Duty-cycle figures: the live measured percentage is always populated
    // (see duty_cycle_pct()'s forward declaration below), independent of
    // whether the limiter is enabled, so the dashboard can show what an
    // operator would be capping before they turn it on. duty_cycle_limit_pct
    // reads 0 - "no ceiling enforced" - whenever g_config.duty_cycle_en is off.
    s.tx_duty_cycle_pct = duty_cycle_pct();
    s.duty_cycle_limit_pct = 0;
    if (g_config.duty_cycle_en) {
        uint8_t ceiling = g_config.duty_cycle_pct;
        if (ceiling < DUTY_CYCLE_PCT_MIN)
            ceiling = DUTY_CYCLE_PCT_MIN;
        else if (ceiling > DUTY_CYCLE_PCT_MAX)
            ceiling = DUTY_CYCLE_PCT_MAX;
        s.duty_cycle_limit_pct = ceiling;
    }

    uint8_t lim = g_config.rf_tx_buffers;
    if (lim < RF_TX_BUFFERS_MIN)
        lim = RF_TX_BUFFERS_MIN;
    else if (lim > RF_TX_BUFFERS_MAX)
        lim = RF_TX_BUFFERS_MAX;
    s.tx_queue_limit = lim;
    return s;
}

void aprs_service_apply_modem_config(void) {
    if (!aprs_service_modem_ready())
        return;
    modem_config_t cfg;
    aprs_service_build_modem_config(&cfg, false);
    modem_set_modem(&cfg);
    ESP_LOGI(TAG, "modem re-applied: modem=%u flatAudio=%d preamble=%ums slot=%ums persist=%u fx25=%u minUnkey=%ums", (unsigned)cfg.modem, (int)cfg.flat_audio,
             (unsigned)cfg.preamble_ms, (unsigned)cfg.slot_time_ms, (unsigned)cfg.persist, (unsigned)cfg.fx25_mode, (unsigned)cfg.min_unkey_ms);
}

// Set true once main.c has actually called modem_init() successfully (i.e.
// the audio modem is enabled in config *and* the hardware came up since boot -
// toggling the checkbox without rebooting does not re-run modem_init).
static volatile bool s_modemReady = false;

// ---------------------------------------------------------------------------
// Duty-cycle accumulator state (see the block comment above DUTY_CYCLE_WINDOW_MS).
//
// s_dutyBucketMs[] is a ring of DUTY_CYCLE_BUCKET_COUNT buckets; s_dutyBucketIndex
// names the bucket currently being written. s_dutyBucketBaseUs is the esp_timer
// time that bucket started at, 0 meaning "never transmitted yet" (nothing to
// slide forward). Touched from whichever task happens to be transmitting -
// RX/digipeat, INET2RF, message TX and every own-station beacon task alike -
// so access is protected by a short spinlock rather than assumed
// single-threaded.
static uint32_t s_dutyBucketMs[DUTY_CYCLE_BUCKET_COUNT];
static uint32_t s_dutyBucketIndex = 0;
static int64_t s_dutyBucketBaseUs = 0;
static portMUX_TYPE s_dutyLock = portMUX_INITIALIZER_UNLOCKED;

// Slides the accumulator ring forward to `now_us`, zeroing every bucket the
// clock has moved past since the last call. Must be called with s_dutyLock held.
static void duty_cycle_advance_locked(int64_t now_us) {
    if (s_dutyBucketBaseUs == 0) {
        // First transmission this boot: open the window here rather than
        // treating the whole idle time since startup as part of it.
        s_dutyBucketBaseUs = now_us;
        return;
    }
    int64_t elapsed_ms = (now_us - s_dutyBucketBaseUs) / 1000;
    if (elapsed_ms < (int64_t)DUTY_CYCLE_BUCKET_MS)
        return; // still inside the current bucket, nothing to slide
    uint32_t buckets_elapsed = (uint32_t)(elapsed_ms / DUTY_CYCLE_BUCKET_MS);
    if (buckets_elapsed >= DUTY_CYCLE_BUCKET_COUNT) {
        // The whole window is stale (nothing transmitted for a full
        // DUTY_CYCLE_WINDOW_MS): clear it all in one pass instead of
        // stepping through DUTY_CYCLE_BUCKET_COUNT no-op writes.
        memset(s_dutyBucketMs, 0, sizeof(s_dutyBucketMs));
    } else {
        for (uint32_t i = 0; i < buckets_elapsed; i++) {
            s_dutyBucketIndex = (s_dutyBucketIndex + 1) % DUTY_CYCLE_BUCKET_COUNT;
            s_dutyBucketMs[s_dutyBucketIndex] = 0;
        }
    }
    s_dutyBucketBaseUs += (int64_t)buckets_elapsed * DUTY_CYCLE_BUCKET_MS * 1000;
}

// Sum of every bucket in the ring: the airtime transmitted within the last
// DUTY_CYCLE_WINDOW_MS as of the last duty_cycle_advance_locked() call. Must
// be called with s_dutyLock held.
static uint32_t duty_cycle_used_ms_locked(void) {
    uint32_t total = 0;
    for (uint32_t i = 0; i < DUTY_CYCLE_BUCKET_COUNT; i++)
        total += s_dutyBucketMs[i];
    return total;
}

// Current measured duty cycle, as a percentage of DUTY_CYCLE_WINDOW_MS,
// capped at 100. Safe to call from any task; used both by the TX gate below
// and by aprs_service_get_stats() for the dashboard.
static uint8_t duty_cycle_pct(void) {
    int64_t now = esp_timer_get_time();
    uint32_t used;
    portENTER_CRITICAL(&s_dutyLock);
    duty_cycle_advance_locked(now);
    used = duty_cycle_used_ms_locked();
    portEXIT_CRITICAL(&s_dutyLock);
    uint32_t pct = (used * 100u) / DUTY_CYCLE_WINDOW_MS;
    return (pct > 100u) ? 100 : (uint8_t)pct;
}

// Adds `ms` of estimated airtime to the bucket the current moment falls into.
// Called once per successful RF transmit, critical or not: the ceiling only
// gates non-critical traffic, but message and digipeat traffic still counts
// against the window, since it is real airtime either way.
static void duty_cycle_add_ms(uint32_t ms) {
    int64_t now = esp_timer_get_time();
    portENTER_CRITICAL(&s_dutyLock);
    duty_cycle_advance_locked(now);
    s_dutyBucketMs[s_dutyBucketIndex] += ms;
    portEXIT_CRITICAL(&s_dutyLock);
}

// Baud rate, in bits/second, of the currently configured audio AFSK
// modulation (see g_config.afsk_modem_type / aprs_service_build_modem_config()),
// used only to turn a frame's byte count into an estimated on-air duration
// for the duty-cycle accumulator below.
static uint32_t duty_cycle_baud_rate(void) {
    switch (g_config.afsk_modem_type) {
        case 0:
            return 300; // AFSK300
        case 3:
            return 9600; // G3RUH/FSK
        default:
            return 1200; // Bell202 or V.23 (both 1200 Bd)
    }
}

// Estimated on-air time, in milliseconds, of transmitting a TNC2 line of
// `tnc2_len` bytes at the current modem settings: the configured TXDelay
// preamble plus the encoded frame at the configured baud rate.
//
// tnc2_len stands in for the actual encoded AX.25 frame's byte count, which
// is not available at this layer - modem_send_tnc2() does its own
// ax25_encode() internally. The two are not identical (binary AX.25 address
// fields are 7 bytes each versus their longer ASCII TNC2 rendering), but
// DUTY_CYCLE_FRAME_OVERHEAD_BYTES and DUTY_CYCLE_BITSTUFF_PCT keep the
// estimate on the conservative side, which is all a duty-cycle *budget*
// needs: it only has to bound cumulative airtime, not time an individual
// frame to the bit.
static uint32_t estimate_tx_airtime_ms(size_t tnc2_len) {
    uint32_t baud = duty_cycle_baud_rate();
    uint32_t frame_bits = ((uint32_t)tnc2_len + DUTY_CYCLE_FRAME_OVERHEAD_BYTES) * 8;
    frame_bits += frame_bits * DUTY_CYCLE_BITSTUFF_PCT / 100;
    uint32_t data_ms = (frame_bits * 1000u) / baud;
    return (uint32_t)g_config.preamble + data_ms;
}

// ---------------------------------------------------------------------------
// TX helper
//
// Callers build TNC2 text into larger scratch buffers and pass a pointer plus a
// length, so the text is not necessarily NUL-terminated at exactly `len`. The
// modem's modem_send_tnc2() needs a NUL-terminated string (it copies into a
// scratch buffer for ax25_encode(), which runs strtok over the digipeater
// path), so the terminator is applied here rather than trusted from the caller.
//
// `critical` exempts message traffic and digipeat repeats from the duty-cycle
// ceiling below (see the DUTY_CYCLE_WINDOW_MS block comment): every other
// caller - every own-station beacon (through the public aprs_service_send_tnc2()
// wrapper) and the bulk IGate INET->RF relay - is held back once this
// station's own measured airtime reaches the configured ceiling. Every
// transmit still counts toward the window regardless of `critical`, since
// message and digipeat traffic is real airtime too; only the gate itself is
// skipped for it.
// ---------------------------------------------------------------------------
static bool send_tnc2_impl(const char *packet, size_t len, bool critical) {
    char buf[AX25_FRAME_MAX_SIZE];

    if (len == 0)
        return false;

    // Drop rather than queue when the modem was never brought up. Two ways to
    // get here: the audio modem is disabled on the Radio page, or the frame is
    // offered during the boot window. aprs_service_start() has to run BEFORE
    // modem_init() because it installs the RX callback, and it starts the
    // beacon tasks, which transmit on entry rather than after their first
    // interval; modem_init() then blocks for ~5 s measuring the ADC clock.
    // Without this gate a boot-time beacon would reach Ax25WriteTxFrame()
    // before Ax25Init() had run.
    if (!s_modemReady) {
        atomic_fetch_add_explicit(&s_statDrop, 1, memory_order_relaxed);
        igate_note_drop(DROP_MODEM_NOT_READY);
        ESP_LOGD(TAG, "modem not up, RF TX dropped: %.*s", (int)len, packet);
        return false;
    }

    // Long-term duty-cycle ceiling: bounds this station's OWN cumulative
    // transmit airtime over the rolling DUTY_CYCLE_WINDOW_MS window,
    // independent of the CSMA channel-access checks (tx_timeslot/csma_persist)
    // and the RF TX ring backlog check below, neither of which look further
    // back than the current instant. Off by default (g_config.duty_cycle_en);
    // when on, only non-critical traffic is held back here - message traffic
    // and digipeat repeats (critical == true) always transmit. A held-back
    // frame is not lost: every non-critical caller is a periodic task that
    // re-offers the same report on its own next interval, so this is a defer
    // rather than a drop, even though it is counted alongside the other
    // reasons in DROP_TX_DUTY_CYCLE for visibility on the dashboard.
    if (!critical && g_config.duty_cycle_en) {
        uint8_t ceiling = g_config.duty_cycle_pct;
        if (ceiling < DUTY_CYCLE_PCT_MIN)
            ceiling = DUTY_CYCLE_PCT_MIN;
        else if (ceiling > DUTY_CYCLE_PCT_MAX)
            ceiling = DUTY_CYCLE_PCT_MAX;
        uint8_t used = duty_cycle_pct();
        if (used >= ceiling) {
            atomic_fetch_add_explicit(&s_statDrop, 1, memory_order_relaxed);
            igate_note_drop(DROP_TX_DUTY_CYCLE);
            ESP_LOGW(TAG, "duty-cycle ceiling reached (%u%%/%u%% of %u min), non-critical TX deferred: %.*s", (unsigned)used, (unsigned)ceiling,
                     (unsigned)(DUTY_CYCLE_WINDOW_MS / 60000U), (int)len, packet);
            return false;
        }
    }

    // Allow a small backlog rather than discarding the moment one frame is
    // in flight: up to g_config.rf_tx_buffers frames may sit in the ring
    // (waiting to key up or on the air right now) before a new packet is
    // dropped instead of queued. Ax25WriteTxFrame() would otherwise happily
    // queue far more (FRAME_MAX_COUNT-1 slots) and, under sustained load
    // (e.g. INET2RF gating faster than the RF channel can clear), eventually
    // drop it anyway once the ring fills - capping the backlog here instead
    // keeps queued packets from going stale and makes the reason visible on
    // the serial console. This only ever touches the RF TX ring - it has no
    // effect on the separate APRS-IS socket buffer used by igate_send_raw(),
    // so a busy RF leg never blocks or drops the IGate leg of the same
    // packet.
    //
    // g_config.rf_tx_buffers is read fresh on every call, so changing it on
    // the Radiomodem page (Audio/AFSK section, "TX buffers") applies to the
    // very next packet with no reboot. Clamp defensively in case flash ever
    // holds a stale/out-of-range value (app_config.c already clamps on
    // load, this is just belt-and-braces against future callers).
    uint8_t limit = g_config.rf_tx_buffers;
    if (limit < RF_TX_BUFFERS_MIN)
        limit = RF_TX_BUFFERS_MIN;
    else if (limit > RF_TX_BUFFERS_MAX)
        limit = RF_TX_BUFFERS_MAX;

    uint8_t pending = modem_tx_queue_depth();
    if (pending >= limit) {
        // Stagger within a scheduler pass instead of dropping. When several
        // own-station beacons fall due together they are serviced back-to-back
        // in the beacon scheduler task, far faster than a 1200 Bd frame clears
        // the air, so with the factory-default TX buffers = 1 the 2nd and 3rd
        // frames would otherwise hit a full ring here and be silently discarded
        // until the next pass (where the same collision could just repeat). In
        // that one task - registered via aprs_service_set_beacon_context(), and
        // only there, so the RX/digipeat, INET2RF and message paths never block
        // - give the ring a bounded chance to drain to below the limit first.
        // This keeps the "one packet on the ring at a time" discipline (we
        // don't grow the ring, we wait our turn on it) while guaranteeing every
        // due beacon eventually keys up.
        if (xTaskGetCurrentTaskHandle() == s_beaconCtxTask) {
            TickType_t deadline = xTaskGetTickCount() + pdMS_TO_TICKS(RF_TX_DRAIN_WAIT_MS);
            while (pending >= limit && (int32_t)(deadline - xTaskGetTickCount()) > 0) {
                vTaskDelay(pdMS_TO_TICKS(RF_TX_DRAIN_POLL_MS));
                pending = modem_tx_queue_depth();
            }
        }
        if (pending >= limit) {
            atomic_fetch_add_explicit(&s_statDrop, 1, memory_order_relaxed);
            igate_note_drop(DROP_TX_QUEUE_FULL);
            ESP_LOGW(TAG, "RF TX queue full (%u/%u pending), packet discarded: %.*s", (unsigned)pending, (unsigned)limit, (int)len, packet);
            return false;
        }
    }
    if (len >= sizeof(buf)) {
        atomic_fetch_add_explicit(&s_statDrop, 1, memory_order_relaxed);
        igate_note_drop(DROP_TX_TOO_LONG);
        ESP_LOGW(TAG, "TNC2 packet too long (%u bytes), dropped", (unsigned)len);
        return false;
    }
    memcpy(buf, packet, len);
    buf[len] = 0;

    esp_err_t err = modem_send_tnc2(buf);
    if (err != ESP_OK) {
        atomic_fetch_add_explicit(&s_statErr, 1, memory_order_relaxed);
        igate_note_drop(ERR_MODEM_SEND_FAIL);
        ESP_LOGW(TAG, "modem_send_tnc2() failed: %s (\"%s\")", esp_err_to_name(err), buf);
        return false;
    }
    atomic_fetch_add_explicit(&s_statRadioTx, 1, memory_order_relaxed);
    // Count this frame's estimated airtime toward the duty-cycle window,
    // whether or not the ceiling above is even enabled, so the dashboard's
    // live figure (see aprs_service_get_stats()) is meaningful the moment an
    // operator turns the limiter on rather than starting from a cold window.
    duty_cycle_add_ms(estimate_tx_airtime_ms(len));
    // Report the backlog right as it stands, not just once the ring finally
    // drains (see ax25.c's "PTT OFF" log). A packet transmits fast enough,
    // relative to how often most of these callers fire, that by the time
    // "PTT OFF" logs the ring is very often already back down to 0 again -
    // that is a legitimate reading of the ring at that later moment, not a
    // sign the rf_tx_buffers limit configured on the Radiomodem page is
    // being ignored. This line is the one that actually shows the backlog
    // building up towards that limit, at the moment each packet is handed
    // off, rather than after it (possibly along with others queued behind
    // it in the same uninterrupted key-up) has already gone out.
    ESP_LOGI(TAG, "queued for RF TX (%u/%u buffer(s) now pending)", (unsigned)modem_tx_queue_depth(), (unsigned)limit);
    return true;
}

// Public, non-critical entry point: every own-station periodic report
// (beacon.c, weather.c, telemetry.c, objects_items.c, bulletins.c) reaches RF
// through this one function, so this is exactly the traffic the duty-cycle
// ceiling in send_tnc2_impl() is meant to hold back first. Message traffic
// and digipeat repeats go through send_tnc2_impl() directly with
// critical == true instead (see aprs_msg_callback(), messageTxHandler() and
// inet2rfHandler() below).
bool aprs_service_send_tnc2(const char *packet, size_t len) {
    return send_tnc2_impl(packet, len, false);
}

// ---------------------------------------------------------------------------
// AX25Msg -> TNC2 text line ("SRC-N>DST-N,PATH...:info"), shared by the digi
// re-transmit path, the igate RF->INET path (igate.c builds its own header
// internally) and message parsing (which works on TNC2 text either way).
//
// The component ships exactly the same rendering as modem_format_tnc2(), so
// this is a thin length-returning wrapper over it rather than a second copy
// that could drift.
// ---------------------------------------------------------------------------
static int ax25ToTnc2(const ax25_msg_t *m, char *out, size_t outMax) {
    modem_format_tnc2(m, out, outMax);
    return (int)strlen(out);
}

// @brief Single dispatch point for digipeater / igate / message, fed by
// on_rx_frame() below for every decoded RX frame.
static void aprs_msg_callback(ax25_msg_t *msg) {
    // This buffer renders a *received* frame, so it is deliberately larger
    // than APRS_TNC2_BUF_SIZE (the size every packet *builder* uses, and the
    // most the RF leg can encode). The TNC2 text of a frame is longer than the
    // frame itself: each 7-byte address field expands to up to 11 characters
    // ("," + 6-char call + "-15" + the repeated "*"), so a maximum-length
    // AX25_FRAME_MAX_SIZE frame renders as at most 365 characters - reached
    // with the full 10 address fields, since every address added costs 7 frame
    // bytes of info field but only 11 text characters. Truncating that here
    // would corrupt the RX console line, the traffic log entry and the message
    // parser's input, so the render always gets room for the worst case, and
    // the RF re-transmit below is what applies the shorter transmit limit
    // (aprs_service_send_tnc2() rejects and logs anything over
    // APRS_TNC2_MAX_LEN).
    char tnc2[APRS_RX_TNC2_BUF_SIZE];
    ax25ToTnc2(msg, tnc2, sizeof(tnc2));

