hiperiondev/esp32idf_APRS/main/aprs_service.c
    // Source callsign (with SSID), used both for the LAST HEARD table and
    // as the DX field of the traffic-table entry below.
    char callsign[12];
    if (msg->src.ssid > 0)
        snprintf(callsign, sizeof(callsign), "%s-%d", msg->src.call, msg->src.ssid);
    else
        snprintf(callsign, sizeof(callsign), "%s", msg->src.call);

    // Position/object/item reports start their info field with one of
    // !=/@; the symbol table and symbol code follow the latitude/longitude
    // fields. Handles both no-timestamp ('!'/'=') and timestamped ('/'/'@')
    // position formats - see aprs_extract_symbol() for the offset math.
    //
    // Payloads that carry no symbol of their own - a raw NMEA sentence above
    // all, which is verbatim GPS receiver output with nowhere to put one -
    // fall back to the AX.25 destination address and then to the source
    // SSID, in the precedence order APRS101 chapter 21 lays down. The
    // information field always wins when it does yield a symbol.
    char symTable = 0, symCode = 0;
    if (!aprs_extract_symbol((const char *)msg->info, msg->len, &symTable, &symCode) && msg->len > 0)
        aprs_symbol_from_dest((char)msg->info[0], msg->dst.call, msg->src.ssid, &symTable, &symCode);

    // Log every decoded RF frame so the web traffic viewer mirrors what the
    // serial console shows for RF activity, regardless of which
    // feature(s) below end up acting on it. AUDIO is the demodulated
    // signal level (mV RMS) reported by the AFSK/GFSK modem for this frame.
    ESP_LOGI(TAG, "RX: %s", tnc2);
    trafficlog_add_pkt("RX", callsign, tnc2, (int)msg->mVrms, symTable, symCode);

    // Mic-E position comment (APRS101 ch.10). It lives in the destination
    // address, so it never appears in the packet text above and would
    // otherwise be invisible to the operator. Emergency is the one value that
    // asks for a human response, so it gets a warning of its own and a line
    // in the traffic log next to the packet that carried it; the other
    // fourteen values are informational.
    {
        const char *miceMsg = NULL;
        bool miceEmergency = false;
        if (aprs_filter_mice_message(msg->dst.call, (const char *)msg->info, msg->len, &miceMsg, &miceEmergency)) {
            if (miceEmergency) {
                ESP_LOGW(TAG, "Mic-E EMERGENCY from %s", callsign);
                trafficlog_add("Mic-E EMERGENCY from %s", callsign);
            } else {
                ESP_LOGI(TAG, "Mic-E position comment from %s: %s", callsign, miceMsg);
            }
        }
    }

    // Feed the web dashboard's "LAST HEARD" table (see components/lastheard).
    {
        // str_append() clamps the running offset itself, so the loop needs no
        // per-iteration room check of its own to stay inside path[]: a frame
        // carrying the AX.25 maximum of 8 repeaters fills the buffer and any
        // remaining entries are simply left out of the display string. This is
        // a LAST HEARD label, so losing the tail of a long path is cosmetic.
        char path[48] = "";
        size_t plen = 0;
        // "Direct" means no digipeater actually relayed this frame. A path
        // entry only counts once its AX.25 "has been repeated" H-bit is set
        // (AX25_REPEATED); an unused WIDEn-N still in the path is a request
        // for a repeat that has not happened yet, so a frame carrying one is
        // still direct from this receiver's point of view. This is what the
        // "?APRSD" query reports, so it has to mean heard-off-the-air rather
        // than merely path-looks-empty. usedHops counts the same repeated
        // entries, giving lastheard_station_count() the hop distance this
        // frame actually travelled, as opposed to the full (possibly still
        // unused) path string kept for display.
        bool direct = true;
        uint8_t usedHops = 0;
        for (int i = 0; i < msg->rpt_count; i++) {
            str_append(path, sizeof(path), &plen, "%s%s", (i == 0) ? "" : ",", msg->rpt_list[i].call);
            if (msg->rpt_list[i].ssid > 0)
                str_append(path, sizeof(path), &plen, "-%d", msg->rpt_list[i].ssid);
            if (AX25_REPEATED(msg, i)) {
                direct = false;
                usedHops++;
            }
        }

        lastheard_add(callsign, path, true, direct, usedHops, symTable, symCode);
    }

    // Placeholder/invalid source callsign check (NOCALL = radio not
    // configured, MYCALL = misconfigured/uninitialized digipeater config
    // sentinel used elsewhere in this codebase). This mirrors the same
    // check digiProcess() does internally, but runs unconditionally here so
    // it (and the dashboard's DROP counter) means something even with
    // digi_en off. A frame from either sentinel is never useful to
    // digipeat, gate, or otherwise act on, so skip the rest of the
    // dispatch chain for it.
    if (!strncmp(msg->src.call, "NOCALL", 6) || !strncmp(msg->src.call, "MYCALL", 6)) {
        atomic_fetch_add_explicit(&s_statDrop, 1, memory_order_relaxed);
        igate_note_drop(DROP_PLACEHOLDER_CALL);
        ESP_LOGD(TAG, "RX dropped, placeholder source callsign: %s", tnc2);
        return;
    }

    if (g_config.digi_en) {
        int action = digiProcess(msg);
        if (action == 2) {
            // Path was rewritten in place by digiProcess(); render the
            // outgoing frame into its own buffer so the received-frame
            // rendering above stays untouched for the consumers below.
            char digiTnc2[APRS_RX_TNC2_BUF_SIZE];
            int len = ax25ToTnc2(msg, digiTnc2, sizeof(digiTnc2));
            if (send_tnc2_impl(digiTnc2, (size_t)len, true)) {
                atomic_fetch_add_explicit(&s_statDigi, 1, memory_order_relaxed);
                ESP_LOGD(TAG, "DIGI TX: %s", digiTnc2);
                trafficlog_add_pkt("DIGI", callsign, digiTnc2, -1, symTable, symCode);
            }
        }
    }

    if (g_config.igate_en && g_config.rf2inet) {
        if (igateProcess(msg)) // builds its own qAR/qAO header and sends to APRS-IS internally
            atomic_fetch_add_explicit(&s_statRf2Inet, 1, memory_order_relaxed);
    }

