hiperiondev/esp32idf_APRS/main/aprs_service.c
        // g_config.inet2rfFilter is a whitelist of payload types (the IGATE
        // Filter fieldset on the /igate page): classify the line and drop it
        // unless its bit is set. Unclassifiable payloads - third-party
        // traffic in particular, which is exactly how an IGate loop starts -
        // classify as 0 and never pass.
        //
        // Dropped lines are logged at debug level only: the RX-IS entry
        // igate.c already added to the traffic ring covers them, and an
        // unfiltered APRS-IS feed would otherwise flush the ring with lines
        // that never went anywhere.
        uint16_t type = aprs_filter_classify_tnc2(line);

        // The plain (non-third-party) TNC2 line that build_thirdparty_frame()
        // below wraps for RF, and the callsign the budlist check is keyed on.
        // Normally both are just the line/callsign as received; the selective
        // third-party unwrap below (only ever reachable for an explicitly
        // whitelisted inner source) may swap both to the unwrapped inner
        // packet instead.
        const char *srcLine = line;
        char budlistCall[12];
        strncpy(budlistCall, callsign, sizeof(budlistCall) - 1);
        budlistCall[sizeof(budlistCall) - 1] = 0;

        // Associated position: a station this gateway has just put a message
        // on the air for gets exactly one of its position reports gated too,
        // whatever the type filter says, so the local operator can plot the
        // far end of the conversation. The claim is taken here rather than
        // after the budlist, so a station the operator has since blacklisted
        // spends its follow-up instead of holding a slot forever. Only plain
        // position and buoy reports qualify - a weather or object report is
        // gated under its own type bit, on its own merits.
        bool assocPosition = false;
        if ((type & (IGATE_FILT_POSITION | IGATE_FILT_BUOY)) != 0 && msgAssocTake(budlistCall)) {
            assocPosition = true;
            ESP_LOGD(TAG, "INET2RF: gating the position follow-up owed to %s", budlistCall);
        }

        if (!assocPosition && !aprs_filter_pass(g_config.inet2rfFilter, type)) {
            // Selective third-party ('}') unwrap: off by default
            // (inet2rf_3rdparty_unwrap_en), and even when enabled only ever
            // fires for a payload that (a) is third-party-wrapped and (b)
            // whose INNER source callsign is itself explicitly whitelisted
            // on the local budlist (inet2rf_budlist_mode == BUDLIST_WHITELIST
            // AND that callsign in g_config.budlist[]). This combination -
            // opt-in AND per-source trust, never either alone - is what
            // keeps this from turning into "relay all third-party traffic",
            // which is the #1 way IGate feedback loops get re-introduced;
            // see aprs_filter_classify_thirdparty_inner()'s docs.
            bool unwrapped = false;

            if (g_config.inet2rf_3rdparty_unwrap_en && g_config.inet2rf_budlist_mode == BUDLIST_WHITELIST) {
                const char *colon = strchr(line, ':');
                if (colon && colon[1] == '}') {
                    // The third-party payload ("}SRC>DST,PATH:payload") is
                    // itself a complete TNC2-style line - unwrapping it is
                    // just skipping the leading '}'.
                    const char *inner = colon + 2;
                    const char *igt = strchr(inner, '>');
                    char innerSrc[12] = "";
                    if (igt) {
                        size_t n = (size_t)(igt - inner);
                        if (n >= sizeof(innerSrc))
                            n = sizeof(innerSrc) - 1;
                        memcpy(innerSrc, inner, n);
                        innerSrc[n] = 0;
                    }

                    // Reject a payload that is itself third-party-wrapped
                    // more than one level deep outright, rather than
                    // unwrapping it again or letting it fall through to the
                    // generic type filter: aprs_filter_classify_thirdparty_inner()
                    // already classifies a nested '}' payload as
                    // unclassifiable (type 0, never passes), but a dedicated
                    // check here makes the one-level limit explicit and
                    // auditable and gives it its own drop counter instead of
                    // being folded into DROP_TYPE_FILTER. A frame nested this
                    // way has been wrapped more than once already; unwrapping
                    // it here would let it re-enter as a fresh single-wrap
                    // frame and grow without bound on every further hop.
                    const char *innerColon = strchr(inner, ':');
                    if (innerColon && innerColon[1] == '}') {
                        ESP_LOGD(TAG, "INET2RF: third-party payload nested more than one level, not unwrapped: %s", line);
                        igate_note_drop(DROP_3RDPARTY_NESTED);
                    } else {
                        uint16_t innerType = aprs_filter_classify_thirdparty_inner(colon + 1);

                        if (innerSrc[0] && aprs_filter_budlist_pass(BUDLIST_WHITELIST, innerSrc) && aprs_filter_pass(g_config.inet2rfFilter, innerType)) {
                            srcLine = inner;
                            type = innerType;
                            strncpy(budlistCall, innerSrc, sizeof(budlistCall) - 1);
                            budlistCall[sizeof(budlistCall) - 1] = 0;
                            unwrapped = true;
                            ESP_LOGI(TAG, "INET2RF: relaying whitelisted third-party packet from %s (unwrapped): %s", innerSrc, inner);
                        }
                    }
                }
            }

            if (!unwrapped) {
                ESP_LOGD(TAG, "INET2RF filtered (%s, mask=0x%03X): %s", aprs_filter_type_name(type), (unsigned)g_config.inet2rfFilter, line);
                igate_note_drop(DROP_TYPE_FILTER);
                return;
            }
        }

