hiperiondev/esp32idf_APRS/main/aprs_service.c
        // Local callsign whitelist/blacklist (INET->RF direction): composes
        // (AND semantics) with the type filter just above, same as the
        // RF->INET side in igate.c's igateProcess(). Keyed on budlistCall,
        // which is the unwrapped inner source when the third-party unwrap
        // above fired, or the as-received callsign otherwise. (Redundant
        // with the whitelist check already done above in the unwrap case,
        // but kept here too so this line always goes through the exact same
        // gate as every other INET->RF packet.)
        if (!aprs_filter_budlist_pass(g_config.inet2rf_budlist_mode, budlistCall)) {
            ESP_LOGD(TAG, "INET2RF budlist-filtered (mode=%d): %s", (int)g_config.inet2rf_budlist_mode, budlistCall);
            igate_note_drop(DROP_BUDLIST);
            return;
        }

        // Message gating policy. Only the MESSAGE type is subject to it: the
        // remaining types are gated at the sysop's discretion, which is what
        // the type filter and the budlist above already express.
        if (g_config.igate_msg_gate_en && type == IGATE_FILT_MESSAGE) {
            const char *infoSep = strchr(srcLine, ':');
            if (infoSep == NULL || !messageGatePass(srcLine, budlistCall, infoSep + 1))
                return;
        }

        // Gated traffic is never keyed onto RF with its APRS-IS header
        // intact: build_thirdparty_frame() replaces that header with this
        // station's own call and path and wraps the original SRC>DST plus
        // its information field, unmodified, behind a '}' as the payload -
        // the mandatory third-party form that keeps qA constructs and TCPIP
        // off the air and lets other IGates recognise the frame as already
        // gated. It already logs a warning on failure (an unusable header or
        // a frame that would not fit), on the same terms as every other
        // packet builder in this firmware, so nothing more is done here than
        // declining to transmit.
        char thirdPartyFrame[APRS_TNC2_BUF_SIZE];
        int txLen = build_thirdparty_frame(srcLine, thirdPartyFrame, sizeof(thirdPartyFrame));
        if (txLen <= 0)
            return;

        // Only an actual APRS message (including the ack sent back for one)
        // is exempt from the duty-cycle ceiling here - the rest of the
        // INET->RF relay (position/object/weather/telemetry/bulletins picked
        // up from APRS-IS) is exactly the bulk, non-critical traffic that
        // ceiling exists to hold back. `type` reflects the unwrapped inner
        // payload when the selective third-party unwrap above fired, so this
        // always tests the type actually being transmitted.
        if (send_tnc2_impl(thirdPartyFrame, (size_t)txLen, (type & IGATE_FILT_MESSAGE) != 0)) {
            atomic_fetch_add_explicit(&s_statInet2Rf, 1, memory_order_relaxed);
            ESP_LOGD(TAG, "INET2RF TX: %.*s", txLen, thirdPartyFrame);
            trafficlog_add_pkt("INET2RF", budlistCall, thirdPartyFrame, -1, symTable, symCode);

            // MSG_CNT in the "?IGATE?" answer counts APRS messages this
            // gateway has passed, in both directions. srcLine's ':' ends
            // its TNC2 address block, so its information field starts right
            // after it and a message is the payload whose first byte is the
            // ':' data type identifier.
            const char *infoSep = strchr(srcLine, ':');
            if (infoSep != NULL && infoSep[1] == ':') {
                igate_note_message_gated();

                // Note the addressee so the next position report seen for it
                // on the APRS-IS feed is gated as well.
                char addressee[12];
                if (messageAddressee(infoSep + 1, addressee, sizeof(addressee)))
                    msgAssocRemember(addressee);
            }
        }
    }
}

// ---------------------------------------------------------------------------
// Outbound message TX: message.c hands us a built TNC2 packet + channel mask.
// ---------------------------------------------------------------------------
static void messageTxHandler(const char *packet, size_t len, uint8_t channels) {
    // Critical: APRS messages (and their acks/retries) are exempt from the
    // duty-cycle ceiling in send_tnc2_impl() - see the block comment there.
    if (channels & MSG_CHANNEL_RF)
        send_tnc2_impl(packet, len, true);
    if (channels & MSG_CHANNEL_INET)
        igate_send_raw(packet, len);
}

// The application does not pump the DSP or drain the frame queue: the modem
// component owns both. AFSK_init() starts its own pinned RX DSP task, and
// modem_init() starts the "modem_svc" task that drives
// AFSK_ServiceTx()/Ax25TransmitCheck() and delivers RX frames to the callback.
// Calling AFSK_Poll() from here would race that task over the same FIFO.
// The modem component has no RF power-switch output, so there is no
// rf_power/band config to carry.

static void serviceTickTask(void *arg) {
    while (1) {
        // 1 Hz weather sensor refresh, folded in here instead of running its
        // own wx_sensor_task (saves that task's stack). weather_start() has
        // already run by the time this task is created, so the shared container
        // and sensor registry are ready.
        weather_service_1hz();

        // 1 Hz Binary (digital B1-B8) telemetry channel refresh - reads the
        // same sensors_local registry weather_service_1hz() does, so it is
        // folded into this existing task rather than getting its own.
        telemetry_service_1hz();

        // SNTP bootstrap step, also folded in here instead of a dedicated
        // time_sync task (saves its 4 KB stack). Non-blocking: it just advances
        // the state machine armed by time_sync_start() and returns.
        time_sync_1hz();

        if (g_config.msg_enable)
            sendAPRSMessageRetry();
        vTaskDelay(pdMS_TO_TICKS(1000));
    }
}

// ---------------------------------------------------------------------------
// Audio ADC/DAC AFSK modem "LOOP TEST" (Radiomodem webconfig page).
// ---------------------------------------------------------------------------

#define LOOP_TEST_TIMEOUT_MS 4000

// How long aprs_loop_test_run() will wait for a clear channel (no DCD lock on
// real off-air traffic) before keying up regardless. Bounded so a stuck/
// falsely-latched DCD (or continuously heavy traffic) can't hang the test
// forever - it just proceeds and, if that on-air signal really does corrupt
// the self-test frame, reports the normal failure diagnostics.
#define LOOP_TEST_CHANNEL_WAIT_MS 3000

static SemaphoreHandle_t s_loopTestSem = NULL;
static volatile bool s_loopTestActive = false;
// Guards the claim of s_loopTestActive. Reading the flag and setting it are one
// indivisible step - two overlapping requests must not both come away believing
// they own the test, which a plain read-then-write would allow. A portMUX (not a
// mutex) because the claim is a handful of instructions and can then be made
// with no allocation and no init-order dependency.
static portMUX_TYPE s_loopTestLock = portMUX_INITIALIZER_UNLOCKED;
static volatile bool s_loopTestGotFrame = false;
static char s_loopTestToken[8];
static char s_loopTestRxInfo[128];
static uint16_t s_loopTestRxMVrms = 0;

