hiperiondev/esp32idf_APRS/main/aprs_service.c
    char expected[24];
    snprintf(expected, sizeof(expected), ">LOOPTEST %s", s_loopTestToken);

    if (strstr(s_loopTestRxInfo, expected) != NULL) {
        // Report the same raw-swing/AGC figures used in the FAIL diagnostics
        // above, not just RMS, so a PASS still gives enough to tell a
        // comfortably-clean signal from one that only just scraped by (e.g.
        // when tuning RV1/RV2 audio level trimmers on the interface board:
        // the swing figure is the clipping-margin indicator - the 12-bit ADC
        // rails are 0/4095, so a healthy centered swing should sit well
        // short of either end).
        int adcSwing = (s_diag.rawCount > 0) ? ((int)s_diag.rawMax - (int)s_diag.rawMin) : 0;
        snprintf(msg, msg_len,
                 "PASS: sent \"%s\" and correctly decoded it back (RX level %u mV RMS, raw ADC swing %d-%d [%d counts, "
                 "rails are 0/4095], AGC peak gain %.2fx). The AFSK modem works correctly.",
                 tnc2 + (strchr(tnc2, ':') - tnc2) + 1, (unsigned)s_loopTestRxMVrms, s_diag.rawMin, s_diag.rawMax, adcSwing, (double)s_diag.agcGainPeak);
        ESP_LOGI(TAG, "Loop test: %s", msg);
        return true;
    }

    snprintf(msg, msg_len,
             "FAIL: a packet was received back, but its content did not match what was sent (got \"%s\"). Check for audio "
             "distortion, clipping, or an incorrect ADC/DAC loopback wiring.",
             s_loopTestRxInfo);
    ESP_LOGW(TAG, "Loop test: %s", msg);
    return false;
}

void aprs_service_start(void) {
    trafficlog_init();
    lastheard_init();
    message_init();
    message_alarm_configure(g_config.msg_alarm_enable, g_config.msg_alarm_gpio);
    message_set_tx_handler(messageTxHandler);
    igate_set_inet2rf_handler(inet2rfHandler);

    query_init();
    query_set_tx_handler(messageTxHandler); // reuse the same RF/INET TX plumbing

    // Install the RX callback before main.c calls modem_init(): the component
    // starts its service task inside modem_init() and can deliver a frame the
    // moment it does.
    modem_set_rx_callback(on_rx_frame, NULL);

    // Always start the uplink task: it idles itself (socket closed,
    // fast retry loop) whenever nothing needs APRS-IS, and comes up as soon
    // as igate_en, digi_loc2inet, or msg_inet is turned on - including via
    // a runtime web UI save, with no reboot required.
    igate_start();

    beacon_start();

    // Own-station weather: creates the shared weather_telemetry_data container,
    // refreshes it from the local sensor drivers at 1 Hz, and beacons an APRS
    // Weather Report at wx_interval.
    weather_start();

    // Own-station telemetry (Binary/digital B1-B8 channel 0): resolves the
    // operator's per-bit channel mapping from the same sensors_local registry
    // weather_start() just brought up, and beacons a "T#..." Telemetry Data
    // Report at its configured data interval (plus BITS metadata at its
    // configured info interval) - both stored in their own
    // /storage/telemetry.json, not g_config; see telemetry.h.
    telemetry_start();

    // Periodic APRS bulletins (BLN1..BLN5), configured on the "Bulletins" web
    // admin page and persisted in their own LittleFS file (not g_config). The
    // task also enforces per-bulletin expiry.
#ifdef ENABLE_BULLETINS
    bulletins_start();
#endif

    // Periodic APRS Objects/Items, configured on the "Objects and Items" web
    // admin page and persisted in their own LittleFS file (not g_config). The
    // shared scheduler drives their transmission and kill retransmissions.
#ifdef ENABLE_OBJECTS_ITEMS
    objitems_start();
#endif

    // Single shared task that drives all of the above periodic transmissions
    // (tracker/igate/digi beacons, WX report, bulletins). Started last, after
    // beacon_start()/weather_start()/bulletins_start() have set up the state
    // its service functions read. Driving every periodic transmitter from one
    // ~14 KB task instead of one task per transmitter is what keeps the total
    // stack footprint of the beacon layer small enough for this heap.
    beacon_scheduler_start();

    // The modem runs its own RX DSP and TX service tasks (see the note above
    // serviceTickTask); the only task this layer needs for itself is the 1 Hz
    // housekeeping tick below.
    //
    // sendAPRSMessageRetry() walks the same TX chain as the beacon services
    // (aprs_service_send_tnc2 -> modem_send_tnc2 -> modem_build_frame_tnc2 ->
    // ax25_encode/hdlcFrame), which stacks several ~300-450 byte buffers per
    // level. Give it the same stack budget those paths were sized for (see
    // BEACON_SCHED_TASK_STACK_BYTES in beacon_scheduler.c), rather than a
    // housekeeping-only budget that the TX chain would overflow.
    xTaskCreate(serviceTickTask, "aprs_svc_tick", 10240, NULL, 4, NULL);

    ESP_LOGI(TAG, "APRS service started (digi=%d igate=%d msg=%d)", g_config.digi_en, g_config.igate_en, g_config.msg_enable);
}
